{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "63edd688",
   "metadata": {},
   "source": [
    "## 连接图数据库"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c7aa29a1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Graph('bolt://neo4j@68.79.23.135:5432')"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "# 连接图数据库neo4j\n",
    "graph = Graph(\"bolt://68.79.23.135:5432\", auth=(\"neo4j\", \"123456\"))\n",
    "graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "b0ec59db",
   "metadata": {},
   "outputs": [],
   "source": [
    "clabel = {'产品名称': '名称',\n",
    " '产品代码': '名称',\n",
    " '产品登记编码': '名称',\n",
    " '理财币种': '属性',\n",
    " '产品类型': '属性',\n",
    " '募集方式': '属性',\n",
    " '运作方式': '属性',\n",
    " '税款': '属性',\n",
    " '理财计划份额': '发行',\n",
    " '理财计划份额面值': '发行',\n",
    " '发行规模': '发行',\n",
    " '本金及理财收益': '收益',\n",
    " '业绩比较基准': '收益',\n",
    " '估值日': '收益',\n",
    " '巨额赎回': '认购申购与赎回',\n",
    " '认购/申购上限': '认购申购与赎回',\n",
    " '认购、申购及赎回方式': '认购申购与赎回',\n",
    " '认购起点': '认购申购与赎回',\n",
    " '认购期': '认购申购与赎回',\n",
    " '认购登记日': '认购申购与赎回',\n",
    " '理财计划申购和赎回': '认购申购与赎回',\n",
    " '费用': '认购申购与赎回',\n",
    " '理财计划到期日': '开始和结束时间',\n",
    " '理财计划成立日': '开始和结束时间',\n",
    " '投资策略': '投资'}\n",
    "\n",
    "name_label = {'产品名称':'name', '产品代码':'code', '产品登记编码':'outer_code', '发行规模': {'上限':'up', '下限':'down'},\n",
    "             '业绩比较基准':{'上限':'up', '下限':'down'}, '认购/申购上限':{'上限':'up', '单位':'unit'}, \n",
    "             '认购起点':{'下限':'down', '单位':'unit'}, '认购期':{'上限':'up', '下限':'down'},\n",
    "              '理财计划申购和赎回': {'周期':'period', '单位':'unit'}, }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "83fe8da7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.name': '招商银行美元金葵季季开6号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵季季开5号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵季季开4号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵季季开3号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵季季开2号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵季季开1号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵一年定开7号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵一年定开6号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵一年定开4号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵一年定开3号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵一年定开2号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行美元金葵一年定开1号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行年年享6号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行年年享5号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开010号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开009号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开008号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开007号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开006号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开005号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开004号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开003号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开002号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开001号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年定开004号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开012号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开011号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开010号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开009号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开008号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开007号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开006号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列一年半定开005号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列半年定开4号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列半年定开3号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列半年定开2号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列一年定开9号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列一年定开8号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列一年定开1号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列一年半定开5号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列一年半定开4号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行零售青葵系列一年半定开1号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。'},\n",
       " {'n.name': '招商银行青葵系列两年定开012号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。若税费政策调整，可能影响理财计划投资收益情况。'},\n",
       " {'n.name': '招商银行青葵系列两年定开011号理财计划',\n",
       "  'm.value': '本理财计划运作过程中涉及的各纳税主体，其纳税义务按国家税收法律、法规执行。除法律法规特别要求外，投资者应缴纳的税收由投资者负责，产品管理人不承担代扣代缴或纳税的义务。理财计划在资产管理、运营、处置过程中产生的收入，根据国家相关法律法规应缴纳增值税（含增值税附加税费，下同）及/或其他税费的，即使本产品管理人被税务机关认定为纳税义务人，该等增值税及/或其他税费仍属于应由理财计划承担的理财计划税费，由本产品管理人申报和缴纳，该等税款直接从理财计划中扣付缴纳。详细内容见本《产品说明书》之“理财计划税费”。若税费政策调整，可能影响理财计划投资收益情况。'}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"Match (n:`名称`)-[rel:`属性`]-(m:`属性`) Where m.name='税款' Return distinct n.name, m.value\").data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 165,
   "id": "4665eaa4",
   "metadata": {},
   "outputs": [],
   "source": [
    "def greater_or_smaller(string):\n",
    "    if string == '大于':\n",
    "        return '>'\n",
    "    elif string == '大于等于':\n",
    "        return '>='\n",
    "    elif string == '小于':\n",
    "        return '<'\n",
    "    elif string == '小于等于':\n",
    "        return '<='\n",
    "    elif string == '等于':\n",
    "        return '='\n",
    "    elif sring == '不等于':\n",
    "        return '<>'\n",
    "    \n",
    "    \n",
    "def match_is_exist(obj_dict, attri_dict, l=clabel, nl=name_label, graph=graph):\n",
    "    # 首先遍历合并相同的属性\n",
    "    after_obj_dict = {}\n",
    "    for obj in obj_dict:\n",
    "        key = list(obj.keys())[0]\n",
    "        value = list(obj.values())[0]\n",
    "        if key in after_obj_dict:\n",
    "            after_obj_dict[key].append(value)\n",
    "        else:\n",
    "            after_obj_dict[key] = [value]\n",
    "    print(after_obj_dict)\n",
    "    \n",
    "    # 同个属性间取“or”，不同属性间取“and”\n",
    "    for key in list(after_obj_dict.keys()):\n",
    "        label = l[key]\n",
    "        value = after_obj_dict[key]\n",
    "        \n",
    "        # 如果类别不等于名称\n",
    "        if label != '名称':\n",
    "            match_ = \"MATCH (m:`{0}`)-[rel:`{0}` {{links:'{1}为'}}]-(n)\".format(label, key)\n",
    "            return_ = \"RETURN n.name\"\n",
    "            where_list = []\n",
    "            \n",
    "            # 如果不在特殊的标签\n",
    "            if key not in nl:\n",
    "                for v in value:\n",
    "                    where_list.append(\"m.value = '{}'\".format(v))\n",
    "                where_ = \"WHERE\" + \" \" + \" or \".join(where_list)\n",
    "                \n",
    "            elif key in ['发行规模', '业绩比较基准', '认购期']:\n",
    "                # 记录需要判断非空的属性\n",
    "                not_null = []\n",
    "                for v in value:\n",
    "                    filter_ =  \"toFloat({})\".format(\"m.{}\".format(nl[key][v[0]])) + \" \" + greater_or_smaller(v[1]) +\\\n",
    "                             \" \" + str(v[2])\n",
    "                    where_list.append(filter_)\n",
    "                    not_null.append(\"m.{}\".format(nl[key][v[0]]) + \" is not null\")\n",
    "                # 合并\n",
    "                not_null = \" and \".join(not_null)\n",
    "                # 这里同一属性间取“and”\n",
    "                where_ = \"WHERE\" + \" (\" + \" and \".join(where_list) + \") and (\" + not_null + \")\"\n",
    "                \n",
    "            elif key in ['认购/申购上限', '认购起点', '理财计划申购和赎回']:\n",
    "                # 记录需要判断非空的属性\n",
    "                not_null = []\n",
    "                for v in value:\n",
    "                    filter_ = \"toFloat({})\".format(\"m.{}\".format(nl[key][list(nl[key].keys())[0]])) + \" \" +\\\n",
    "                            greater_or_smaller(v[0]) + \" \" + str(v[1]) + \" and \" + \"m.unit = '{}'\".format(v[2])\n",
    "                    where_list.append(filter_)\n",
    "                    not_null.append(\"m.{}\".format(nl[key][list(nl[key].keys())[0]]) + \" is not null\")\n",
    "                # 合并\n",
    "                not_null = \" and \".join(not_null)\n",
    "                # 这里同一属性间取“and”\n",
    "                where_ = \"WHERE\" + \" (\" + \" and \".join(where_list) + \") and (\" + not_null + \")\"\n",
    "    \n",
    "        else:\n",
    "            match_ = \"MATCH (n:`名称`)\"\n",
    "            return_ = \"RETURN n.name\"\n",
    "            where_list = []\n",
    "            \n",
    "            for v in value:\n",
    "                where_list.append(\"n.{} = '.*{}.*'\".format(nl[key], v))\n",
    "            where_ = \"WHERE\" + \" \" + \" or \".join(where_list)\n",
    "            \n",
    "        print(match_+\" \"+where_+\" \"+return_)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 166,
   "id": "4e1cbd6e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'产品名称': ['青葵', '招商银行'], '产品代码': ['C18654'], '认购/申购上限': [['小于等于', '40000000', '元'], ['大于等于', '10000000', '元']]}\n",
      "MATCH (n:`名称`) WHERE n.name = '.*青葵.*' or n.name = '.*招商银行.*' RETURN n.name\n",
      "MATCH (n:`名称`) WHERE n.code = '.*C18654.*' RETURN n.name\n",
      "MATCH (m:`认购申购与赎回`)-[rel:`认购申购与赎回` {links:'认购/申购上限为'}]-(n) WHERE (toFloat(m.up) <= 40000000 and m.unit = '元' and toFloat(m.up) >= 10000000 and m.unit = '元') and (m.up is not null and m.up is not null) RETURN n.name\n"
     ]
    }
   ],
   "source": [
    " match_is_exist([{'产品名称': '青葵'}, \n",
    "                 {'产品名称': '招商银行'},\n",
    "                 {'产品代码': 'C18654'},\n",
    "                 {'认购/申购上限': ['小于等于','40000000', '元']},\n",
    "                 {'认购/申购上限': ['大于等于','10000000', '元']}], None)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9cb9e513",
   "metadata": {},
   "source": [
    "[{'理财币种': '人民币'}, {'理财币种': '美元'}]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "18e4b675",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (m:`投资`)-[rel:`投资` {links:'理财币种为'}]-(n) WHERE m.name = '理财币种' and m.value = '人民币' RETURN n.name\n",
      "MATCH (n:`名称`) WHERE n.name =~ '.*青葵.*' RETURN n.name\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'理财币种:人民币': ['招商银行青葵系列两年定开012号理财计划',\n",
       "  '招商银行青葵系列两年定开011号理财计划',\n",
       "  '招商银行青葵系列两年定开010号理财计划',\n",
       "  '招商银行青葵系列两年定开009号理财计划',\n",
       "  '招商银行青葵系列两年定开008号理财计划',\n",
       "  '招商银行青葵系列两年定开007号理财计划',\n",
       "  '招商银行青葵系列两年定开006号理财计划',\n",
       "  '招商银行青葵系列两年定开005号理财计划',\n",
       "  '招商银行青葵系列两年定开004号理财计划',\n",
       "  '招商银行青葵系列两年定开003号理财计划',\n",
       "  '招商银行青葵系列两年定开002号理财计划',\n",
       "  '招商银行青葵系列两年定开001号理财计划',\n",
       "  '招商银行青葵系列一年定开004号理财计划',\n",
       "  '招商银行青葵系列一年半定开012号理财计划',\n",
       "  '招商银行青葵系列一年半定开011号理财计划',\n",
       "  '招商银行青葵系列一年半定开010号理财计划',\n",
       "  '招商银行青葵系列一年半定开009号理财计划',\n",
       "  '招商银行青葵系列一年半定开008号理财计划',\n",
       "  '招商银行青葵系列一年半定开007号理财计划',\n",
       "  '招商银行青葵系列一年半定开006号理财计划',\n",
       "  '招商银行青葵系列一年半定开005号理财计划',\n",
       "  '招商银行零售青葵系列半年定开4号理财计划',\n",
       "  '招商银行零售青葵系列半年定开3号理财计划',\n",
       "  '招商银行零售青葵系列半年定开2号理财计划',\n",
       "  '招商银行零售青葵系列一年定开9号理财计划',\n",
       "  '招商银行零售青葵系列一年定开8号理财计划',\n",
       "  '招商银行零售青葵系列一年定开1号理财计划',\n",
       "  '招商银行零售青葵系列一年半定开5号理财计划',\n",
       "  '招商银行零售青葵系列一年半定开4号理财计划',\n",
       "  '招商银行零售青葵系列一年半定开1号理财计划',\n",
       "  '招商银行年年享6号理财计划',\n",
       "  '招商银行年年享5号理财计划'],\n",
       " '产品名称:青葵': ['招商银行零售青葵系列一年半定开1号理财计划',\n",
       "  '招商银行零售青葵系列一年半定开4号理财计划',\n",
       "  '招商银行零售青葵系列一年半定开5号理财计划',\n",
       "  '招商银行零售青葵系列一年定开1号理财计划',\n",
       "  '招商银行零售青葵系列一年定开8号理财计划',\n",
       "  '招商银行零售青葵系列一年定开9号理财计划',\n",
       "  '招商银行零售青葵系列半年定开2号理财计划',\n",
       "  '招商银行零售青葵系列半年定开3号理财计划',\n",
       "  '招商银行零售青葵系列半年定开4号理财计划',\n",
       "  '招商银行青葵系列一年半定开005号理财计划',\n",
       "  '招商银行青葵系列一年半定开006号理财计划',\n",
       "  '招商银行青葵系列一年半定开007号理财计划',\n",
       "  '招商银行青葵系列一年半定开008号理财计划',\n",
       "  '招商银行青葵系列一年半定开009号理财计划',\n",
       "  '招商银行青葵系列一年半定开010号理财计划',\n",
       "  '招商银行青葵系列一年半定开011号理财计划',\n",
       "  '招商银行青葵系列一年半定开012号理财计划',\n",
       "  '招商银行青葵系列一年定开004号理财计划',\n",
       "  '招商银行青葵系列两年定开001号理财计划',\n",
       "  '招商银行青葵系列两年定开002号理财计划',\n",
       "  '招商银行青葵系列两年定开003号理财计划',\n",
       "  '招商银行青葵系列两年定开004号理财计划',\n",
       "  '招商银行青葵系列两年定开005号理财计划',\n",
       "  '招商银行青葵系列两年定开006号理财计划',\n",
       "  '招商银行青葵系列两年定开007号理财计划',\n",
       "  '招商银行青葵系列两年定开008号理财计划',\n",
       "  '招商银行青葵系列两年定开009号理财计划',\n",
       "  '招商银行青葵系列两年定开010号理财计划',\n",
       "  '招商银行青葵系列两年定开011号理财计划',\n",
       "  '招商银行青葵系列两年定开012号理财计划']}"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "match_graph([{'理财币种': '人民币'}, {'产品名称':'青葵'}], ['募集方式', '产品代码', '产品名称'])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "36071011",
   "metadata": {},
   "source": [
    "### 1、查询是否存在(则只针对名称属性进行查询，发现不是名称属性的一律跳过)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "0ecdbb74",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "({'招商银行青葵系列两年定开005号理财计划': [{'n': Node('名称', code='301060', id='36', name='招商银行青葵系列两年定开005号理财计划', outer_code='C1030820000104')}],\n",
       "  '青葵系列': [{'n': Node('名称', code='301037', id='14', name='招商银行零售青葵系列一年半定开1号理财计划', outer_code='C1030819000278')},\n",
       "   {'n': Node('名称', code='301040', id='15', name='招商银行零售青葵系列一年半定开4号理财计划', outer_code='C1030819000799')},\n",
       "   {'n': Node('名称', code='301041', id='16', name='招商银行零售青葵系列一年半定开5号理财计划', outer_code='C1030819000993')},\n",
       "   {'n': Node('名称', code='301025', id='17', name='招商银行零售青葵系列一年定开1号理财计划', outer_code='C1030819000030')},\n",
       "   {'n': Node('名称', code='301032', id='18', name='招商银行零售青葵系列一年定开8号理财计划', outer_code='C1030819000923')},\n",
       "   {'n': Node('名称', code='301033', id='19', name='招商银行零售青葵系列一年定开9号理财计划', outer_code='C1030819000949')},\n",
       "   {'n': Node('名称', code='301002', id='20', name='招商银行零售青葵系列半年定开2号理财计划', outer_code='C1030819000064')},\n",
       "   {'n': Node('名称', code='301003', id='21', name='招商银行零售青葵系列半年定开3号理财计划', outer_code='C1030819000111')},\n",
       "   {'n': Node('名称', code='301004', id='22', name='招商银行零售青葵系列半年定开4号理财计划', outer_code='C1030819000177')},\n",
       "   {'n': Node('名称', code='301047', id='23', name='招商银行青葵系列一年半定开005号理财计划', outer_code='C1030820000013')},\n",
       "   {'n': Node('名称', code='301048', id='24', name='招商银行青葵系列一年半定开006号理财计划', outer_code='C1030820000132')},\n",
       "   {'n': Node('名称', code='301049', id='25', name='招商银行青葵系列一年半定开007号理财计划', outer_code='C1030820000240')},\n",
       "   {'n': Node('名称', code='301050', id='26', name='招商银行青葵系列一年半定开008号理财计划', outer_code='C1030820000372')},\n",
       "   {'n': Node('名称', code='301051', id='27', name='招商银行青葵系列一年半定开009号理财计划', outer_code='C1030820000476')},\n",
       "   {'n': Node('名称', code='301052', id='28', name='招商银行青葵系列一年半定开010号理财计划', outer_code='C1030820000592')},\n",
       "   {'n': Node('名称', code='301053', id='29', name='招商银行青葵系列一年半定开011号理财计划', outer_code='C1030820000622')},\n",
       "   {'n': Node('名称', code='301054', id='30', name='招商银行青葵系列一年半定开012号理财计划', outer_code='C1030820000636')},\n",
       "   {'n': Node('名称', code='301082', id='31', name='招商银行青葵系列一年定开004号理财计划', outer_code='C1030819001710')},\n",
       "   {'n': Node('名称', code='301056', id='32', name='招商银行青葵系列两年定开001号理财计划', outer_code='C1030819001328')},\n",
       "   {'n': Node('名称', code='301057', id='33', name='招商银行青葵系列两年定开002号理财计划', outer_code='C1030819001462')},\n",
       "   {'n': Node('名称', code='301058', id='34', name='招商银行青葵系列两年定开003号理财计划', outer_code='C1030819001594')},\n",
       "   {'n': Node('名称', code='301059', id='35', name='招商银行青葵系列两年定开004号理财计划', outer_code='C1030819001739')},\n",
       "   {'n': Node('名称', code='301060', id='36', name='招商银行青葵系列两年定开005号理财计划', outer_code='C1030820000104')},\n",
       "   {'n': Node('名称', code='301061', id='37', name='招商银行青葵系列两年定开006号理财计划', outer_code='C1030820000159')},\n",
       "   {'n': Node('名称', code='301062', id='38', name='招商银行青葵系列两年定开007号理财计划', outer_code='C1030820000290')},\n",
       "   {'n': Node('名称', code='301063', id='39', name='招商银行青葵系列两年定开008号理财计划', outer_code='C1030820000445')},\n",
       "   {'n': Node('名称', code='301064', id='40', name='招商银行青葵系列两年定开009号理财计划', outer_code='C1030820000511')},\n",
       "   {'n': Node('名称', code='301065', id='41', name='招商银行青葵系列两年定开010号理财计划', outer_code='C1030820000620')},\n",
       "   {'n': Node('名称', code='301066', id='42', name='招商银行青葵系列两年定开011号理财计划', outer_code='C1030820000625')},\n",
       "   {'n': Node('名称', code='301067', id='43', name='招商银行青葵系列两年定开012号理财计划', outer_code='C1030820000662')}],\n",
       "  '小儿感冒灵计划': '数据库中暂时没有记录该（类）说明书，管理员将会在核实后对数据库进行补充！',\n",
       "  'C1030820000104': [{'n': Node('名称', code='301060', id='36', name='招商银行青葵系列两年定开005号理财计划', outer_code='C1030820000104')}]},\n",
       " {'产品名称': '小儿感冒灵计划'},\n",
       " {'Error': '您一次提问过多，只解答了部分疑问，麻烦您根据目前结果有针对性地对未解答的问题再次提问，谢谢！'})"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "match_graph([{'产品名称': '招商银行青葵系列两年定开005号理财计划'}, {'产品名称': '青葵系列'},\\\n",
    "             {'产品名称': '小儿感冒灵计划'}, {'产品登记编码': 'C1030820000104'}, {'投资策略':'一年期'}], ['是否存在'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "2019a2e0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m': Node('名称', code='2112', id='13', name='招商银行美元金葵季季开6号理财计划', outer_code='C1030820000437'),\n",
       "  'rel2': 收益(Node('名称', code='2112', id='13', name='招商银行美元金葵季季开6号理财计划', outer_code='C1030820000437'), Node('收益', id='116', name='业绩比较基准', value='首个投资周期年化1.5%-2.1%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='116', name='业绩比较基准', value='首个投资周期年化1.5%-2.1%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2110', id='12', name='招商银行美元金葵季季开5号理财计划', outer_code='C1030820000314'),\n",
       "  'rel2': 收益(Node('名称', code='2110', id='12', name='招商银行美元金葵季季开5号理财计划', outer_code='C1030820000314'), Node('收益', id='115', name='业绩比较基准', value='首个投资周期年化1.6%-2.2%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='115', name='业绩比较基准', value='首个投资周期年化1.6%-2.2%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2108', id='11', name='招商银行美元金葵季季开4号理财计划', outer_code='C1030820000195'),\n",
       "  'rel2': 收益(Node('名称', code='2108', id='11', name='招商银行美元金葵季季开4号理财计划', outer_code='C1030820000195'), Node('收益', id='114', name='业绩比较基准', value='首个投资周期年化1.9%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='114', name='业绩比较基准', value='首个投资周期年化1.9%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2106', id='10', name='招商银行美元金葵季季开3号理财计划', outer_code='C1030820000056'),\n",
       "  'rel2': 收益(Node('名称', code='2106', id='10', name='招商银行美元金葵季季开3号理财计划', outer_code='C1030820000056'), Node('收益', id='114', name='业绩比较基准', value='首个投资周期年化1.9%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='114', name='业绩比较基准', value='首个投资周期年化1.9%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2104', id='9', name='招商银行美元金葵季季开2号理财计划', outer_code='C1030819001715'),\n",
       "  'rel2': 收益(Node('名称', code='2104', id='9', name='招商银行美元金葵季季开2号理财计划', outer_code='C1030819001715'), Node('收益', id='114', name='业绩比较基准', value='首个投资周期年化1.9%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='114', name='业绩比较基准', value='首个投资周期年化1.9%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2102', id='8', name='招商银行美元金葵季季开1号理财计划', outer_code='C1030819001531'),\n",
       "  'rel2': 收益(Node('名称', code='2102', id='8', name='招商银行美元金葵季季开1号理财计划', outer_code='C1030819001531'), Node('收益', id='113', name='业绩比较基准', value='首个投资周期年化1.7%-2.3%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='113', name='业绩比较基准', value='首个投资周期年化1.7%-2.3%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2113', id='7', name='招商银行美元金葵一年定开7号理财计划', outer_code='C1030820000624'),\n",
       "  'rel2': 收益(Node('名称', code='2113', id='7', name='招商银行美元金葵一年定开7号理财计划', outer_code='C1030820000624'), Node('收益', id='112', name='业绩比较基准', value='首个投资周期年化1.5%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='112', name='业绩比较基准', value='首个投资周期年化1.5%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2111', id='6', name='招商银行美元金葵一年定开6号理财计划', outer_code='C1030820000599'),\n",
       "  'rel2': 收益(Node('名称', code='2111', id='6', name='招商银行美元金葵一年定开6号理财计划', outer_code='C1030820000599'), Node('收益', id='112', name='业绩比较基准', value='首个投资周期年化1.5%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='112', name='业绩比较基准', value='首个投资周期年化1.5%-2.5%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2107', id='5', name='招商银行美元金葵一年定开4号理财计划', outer_code='C1030820000164'),\n",
       "  'rel2': 收益(Node('名称', code='2107', id='5', name='招商银行美元金葵一年定开4号理财计划', outer_code='C1030820000164'), Node('收益', id='111', name='业绩比较基准', value='首个投资周期年化1.9%-2.9%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='111', name='业绩比较基准', value='首个投资周期年化1.9%-2.9%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2105', id='4', name='招商银行美元金葵一年定开3号理财计划', outer_code='C1030820000012'),\n",
       "  'rel2': 收益(Node('名称', code='2105', id='4', name='招商银行美元金葵一年定开3号理财计划', outer_code='C1030820000012'), Node('收益', id='111', name='业绩比较基准', value='首个投资周期年化1.9%-2.9%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='111', name='业绩比较基准', value='首个投资周期年化1.9%-2.9%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2103', id='3', name='招商银行美元金葵一年定开2号理财计划', outer_code='C1030819001689'),\n",
       "  'rel2': 收益(Node('名称', code='2103', id='3', name='招商银行美元金葵一年定开2号理财计划', outer_code='C1030819001689'), Node('收益', id='110', name='业绩比较基准', value='首个投资周期年化2.0%-3.0%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='110', name='业绩比较基准', value='首个投资周期年化2.0%-3.0%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')},\n",
       " {'m': Node('名称', code='2101', id='2', name='招商银行美元金葵一年定开1号理财计划', outer_code='C1030819001500'),\n",
       "  'rel2': 收益(Node('名称', code='2101', id='2', name='招商银行美元金葵一年定开1号理财计划', outer_code='C1030819001500'), Node('收益', id='110', name='业绩比较基准', value='首个投资周期年化2.0%-3.0%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。'), links='业绩比较基准为'),\n",
       "  'p': Node('收益', id='110', name='业绩比较基准', value='首个投资周期年化2.0%-3.0%，业绩比较基准不代表本产品的未来表现和实际收益，或招商银行对本产品进行的收益承诺。招商银行有权根据市场情况进行调整，该调整将通过一网通上“信息公告”进行信息披露。')}]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"MATCH (n:`投资`)-[rel1:`投资` {links:'理财币种为'}]-(m)-[rel2:`收益` {links:'业绩比较基准为'}]-(p) \\\n",
    "            WHERE n.name = '理财币种' and n.value = '美元' and m.name =~ '.*' RETURN m,rel2,p\").data()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": true,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
